luckyCharm1123/STM32_LED/Core/Src/main.c
  HAL_StatusTypeDef st = HAL_UART_Receive_IT(&huart2, &lora_rx_byte, 1);
  if(st == HAL_OK || st == HAL_BUSY)
  {
    return;
  }

  __HAL_UART_CLEAR_OREFLAG(&huart2);
  __HAL_UART_CLEAR_FEFLAG(&huart2);
  __HAL_UART_CLEAR_NEFLAG(&huart2);
  __HAL_UART_CLEAR_PEFLAG(&huart2);
  (void)HAL_UART_AbortReceive(&huart2);

  for(uint8_t i = 0; i < 2; i++)
  {
    HAL_Delay(1);
    st = HAL_UART_Receive_IT(&huart2, &lora_rx_byte, 1);
    if(st == HAL_OK || st == HAL_BUSY)
    {
      return;
    }
  }
}

/**
  * @brief 初始化声音采样累积器
  * @retval None
  */
static void SoundAccumulator_Init(void)
{
  g_sound_acc.sum_raw = 0;
  g_sound_acc.sample_count = 0;
  g_sound_acc.last_sample_tick = HAL_GetTick();
  g_sound_acc.ema_raw_q8 = 0;
  g_sound_acc.last_output_raw = 0;
  g_sound_acc.ema_initialized = 0;
  g_sound_acc.initialized = 1;
}

/**
  * @brief 按固定周期采样声音传感器并累积到窗口
  * @retval None
  */
static void SoundAccumulator_Update(void)
{
  if(!g_sound_acc.initialized)
  {
    SoundAccumulator_Init();
    return;
  }

  uint32_t now = HAL_GetTick();
  uint32_t elapsed = now - g_sound_acc.last_sample_tick;

  while(elapsed >= SOUND_SAMPLE_INTERVAL_MS)
  {
    uint16_t raw = SOUND_SENSOR_ReadRaw();
    if(raw != 0xFFFFu)
    {
      g_sound_acc.sum_raw += raw;
      g_sound_acc.sample_count++;
    }

    g_sound_acc.last_sample_tick += SOUND_SAMPLE_INTERVAL_MS;
    elapsed -= SOUND_SAMPLE_INTERVAL_MS;
  }
}

/**
  * @brief 对窗口均值做EMA平滑和死区抗抖
  * @param raw: 当前窗口均值
  * @retval 处理后的稳定值
  */
static uint16_t SoundAccumulator_FilterRaw(uint16_t raw)
{
  if(!g_sound_acc.ema_initialized)
  {
    g_sound_acc.ema_raw_q8 = ((uint32_t)raw << 8);
    g_sound_acc.last_output_raw = raw;
    g_sound_acc.ema_initialized = 1;
    return raw;
  }

  {
    int32_t target_q8 = (int32_t)((uint32_t)raw << 8);
    int32_t current_q8 = (int32_t)g_sound_acc.ema_raw_q8;
    int32_t delta_q8 = target_q8 - current_q8;
    current_q8 += (delta_q8 / (int32_t)SOUND_EMA_ALPHA_DEN);
    g_sound_acc.ema_raw_q8 = (uint32_t)current_q8;
  }

  {
    uint16_t ema_raw = (uint16_t)((g_sound_acc.ema_raw_q8 + 128u) >> 8);
    uint16_t last_raw = g_sound_acc.last_output_raw;
    uint16_t diff = (ema_raw > last_raw) ? (ema_raw - last_raw) : (last_raw - ema_raw);

    if(diff < SOUND_DEAD_BAND_RAW)
    {
      return last_raw;
    }

    g_sound_acc.last_output_raw = ema_raw;
    return ema_raw;
  }
}

/**
  * @brief 获取窗口平均声音原始值并清空窗口
  * @retval 平均ADC原始值(0-4095)
  */
static uint16_t SoundAccumulator_GetAverageAndReset(void)
{
  uint16_t avg_raw = 0;

  if(g_sound_acc.sample_count > 0)
  {
    avg_raw = (uint16_t)((g_sound_acc.sum_raw + (g_sound_acc.sample_count / 2u)) / g_sound_acc.sample_count);
  }
  else
  {
    uint16_t fallback_raw = SOUND_SENSOR_ReadRaw();
    if(fallback_raw != 0xFFFFu)
    {
      avg_raw = fallback_raw;
    }
    else
    {
      avg_raw = g_sound_acc.ema_initialized ? g_sound_acc.last_output_raw : 0u;
    }
  }

  g_sound_acc.sum_raw = 0;
  g_sound_acc.sample_count = 0;
  return SoundAccumulator_FilterRaw(avg_raw);
}

/**
  * @brief 记录一次上报，并统计Getdata应答缺失次数
  * @retval None
  * @details 如果上一轮上报仍未收到Getdata，且又发起了新一轮上报，
  *          则记为一次“搜索未收到Getdata”。
  */
static void LORA_MarkUplinkAndTrackGetdata(void)
{
  if(g_waiting_getdata_ack)
  {
    if(g_getdata_miss_count < 0xFFu)
    {
      g_getdata_miss_count++;
    }
  }

  g_last_uplink_time = HAL_GetTick();
  g_waiting_getdata_ack = 1;
}

/**
  * @brief 启动时扫描软件I2C总线地址（PB6/PB7）
  * @note  用于快速确认VEML7700(0x10)是否真实在线
  * @note  已禁用调用和所有调试输出，避免初始化时红色LED长亮
  */
__attribute__((unused)) static void LIGHT_I2C_ScanOnBoot(void)
{
  // char msg[96];  // 已禁用调试输出
  uint8_t addr;
  uint8_t found_count = 0;
  uint8_t found_veml = 0;

  // DEBUG_SendString("[LIGHT SCAN] I2C scan start (7bit 0x08~0x77)\r\n");  // 已禁用

  for(addr = 0x08; addr <= 0x77; addr++)
  {
    if(VEML7700_ProbeAddress7bit(addr) == 0)
    {
      found_count++;
      if(addr == 0x10)
      {
        found_veml = 1;
      }

      // snprintf(msg, sizeof(msg), "[LIGHT SCAN] found: 0x%02X\r\n", addr);  // 已禁用
      // DEBUG_SendString(msg);
    }
  }

  // snprintf(msg, sizeof(msg), "[LIGHT SCAN] total devices: %u\r\n", found_count);  // 已禁用
  // DEBUG_SendString(msg);

  // if(found_veml)
  // {
  //   DEBUG_SendString("[LIGHT SCAN] VEML7700 address 0x10 detected\r\n");  // 已禁用
  // }
  // else
  // {
  //   DEBUG_SendString("[LIGHT SCAN] WARNING: 0x10 not detected\r\n");  // 已禁用
  // }

  (void)found_count;  // 避免未使用变量警告
  (void)found_veml;   // 避免未使用变量警告
}

int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();              // 初始化GPIO
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（LoRa串口）
  MX_USART3_UART_Init();       // 初始化USART3（雷达串口）
  SHT30_Soft_Init();            // 初始化软件I2C
  MHZ19B_PWM_Init();            // 初始化MH-Z19B CO2传感器（PWM方式）
  MHZ19B_Co2SM_Start(&g_co2_sm);  // 提前启动CO2测量，首次发送时即可有结果

  /* 点亮红色LED，表示I2C扫描和光传感器初始化开始 */
  RED_LED_On();

  // LIGHT_I2C_ScanOnBoot();       // 扫描I2C总线设备
  SOUND_SENSOR_Init();          // 初始化声音传感器ADC
  SoundAccumulator_Init();      // 初始化声音按秒采样累积器

  /* 检测VEML7700光传感器 */
  if(VEML7700_IsConnected() == 0)
  {
    // DEBUG_SendString("[LIGHT] VEML7700 detected on I2C bus\r\n");
    if(VEML7700_Soft_Init() == 0)
    {
      // DEBUG_SendString("[LIGHT] VEML7700 initialized successfully\r\n");

      /* 读取配置寄存器验证 */
      uint16_t config_reg = 0;
      if(VEML7700_ReadReg(0x00, &config_reg) == 0)
      {
        // char conf_msg[64];
        // snprintf(conf_msg, sizeof(conf_msg), "[LIGHT] Config Reg: 0x%04X\r\n", config_reg);
        // DEBUG_SendString(conf_msg);
        (void)config_reg;  // 避免未使用变量警告
      }

      /* 读取ALS高字节寄存器 */
      uint16_t als_high = 0, als_low = 0;
      if(VEML7700_ReadReg(0x04, &als_high) == 0 && VEML7700_ReadReg(0x05, &als_low) == 0)
      {
        // char als_msg[64];
        // snprintf(als_msg, sizeof(als_msg), "[LIGHT] ALS Raw: 0x%04X 0x%04X\r\n", als_high, als_low);
        // DEBUG_SendString(als_msg);
        (void)als_high;  // 避免未使用变量警告
        (void)als_low;   // 避免未使用变量警告
      }
    }
    // else
    // {
    //   DEBUG_SendString("[LIGHT] WARNING: VEML7700 init failed\r\n");
    // }
  }
  // else
  // {
  //   DEBUG_SendString("[LIGHT] WARNING: VEML7700 not detected (check wiring)\r\n");
  // }

  /* 熄灭红色LED，表示I2C扫描和光传感器初始化完成 */
  RED_LED_Off();

  HAL_Delay(10);

  /* 初始化雷达模块 */
  if(RADAR_Init() != 0)
  {
    // DEBUG_SendString("[ERR] Radar init failed\r\n");
  }

  /* 启动红色LED呼吸灯，表示开始LoRa初始化和配置 */
  RED_LED_Breathing_Init();

  /* 初始化LoRa模块（USART2，波特率9600） */
  // DEBUG_SendString("[LORA] Initializing...\r\n");
  // DEBUG_SendString("[LORA] Step 1: Sending +++ command (waiting for 'Entry AT')...\r\n");

  /* 生成设备码（基于芯片唯一ID）- 必须在发送之前生成 */
  Generate_Device_Code(g_device_code);
  char device_msg[64];
  /* 拼接字符串 */
  snprintf(device_msg, sizeof(device_msg), "Device Code: %s\r\n", g_device_code);
  /* 发送到串口调试 */
  // DEBUG_SendString(device_msg);

  if(LORA_Init(9600) != 0)
  {
    // DEBUG_SendString("[ERR] LoRa init failed\r\n");
  }
  else
  {
    // DEBUG_SendString("[LORA] LoRa initialized successfully\r\n");

    /* LoRa初始化成功后，立即发送设备ID请求 */
    Send_Config_Request();

    /* 不再等待10秒，直接进入主循环，在主循环中处理配置响应和重试 */
    /* 如果服务器无响应，主循环会每隔3秒自动重试 */
  }

  /* 初始化状态发送机 */
  StateSender_Init();

  /* 传感器状态输出计时变量 */
  static uint32_t last_sensor_output_time = 0;
  const uint32_t sensor_output_interval = 500;  // 500ms输出一次

  /* 雷达状态变量 */
  static uint8_t last_radar_has_person = 1;  // 上次雷达状态（0=无人，1=有人），默认有人

  while (1)
  {
    /* 更新LED呼吸灯效果 */
    RED_LED_Breathing_Update();
    SoundAccumulator_Update();  /* 按采样周期采集声音 */
    MHZ19B_Co2SM_Update(&g_co2_sm);  /* 推进CO2非阻塞测量 */

