luckyCharm1123/STM32_LED/Core/Src/main.c
    /* 如果LoRa未配置，检查是否需要重试发送配置请求 */
    if(!g_lora_configured)
    {
      uint32_t now = HAL_GetTick();
      extern LORA_Status_t lora_status;
      const uint32_t rx_guard_ms = 350;  // 最近收到下行后，短时间内不主动上行
      /* 距离上次请求超过当前重试间隔，重新发送（指数退避前的线性退避） */
      if((now - g_last_config_request_time) >= (g_config_retry_interval_ms + g_config_retry_jitter_ms))
      {
        if(!LORA_IsDataReady() && (now - lora_status.last_rx_time) >= rx_guard_ms)
        {
          if(Send_Config_Request() == 0)
          {
            if(g_config_retry_interval_ms < 12000)
            {
              g_config_retry_interval_ms += 1000;
            }
          }
        }
      }
    }

    /* 处理雷达数据 */
    RADAR_Process();

    /* 检查LoRa是否接收到数据 */
    if(LORA_IsDataReady())
    {
      uint8_t lora_rx_data[256];
      uint16_t lora_rx_len = LORA_GetData(lora_rx_data, sizeof(lora_rx_data));

      /* 重启UART接收中断，准备接收下一帧数据 */
      LORA_RearmRxIT();

      if(lora_rx_len > 0)
      {
        // char debug_msg[512];

        /* 打印设备ID用于调试 */
        // snprintf(debug_msg, sizeof(debug_msg),
        //          "[LORA] My Device ID: %s\r\n", g_device_code);
        // DEBUG_SendString(debug_msg);

        /* 按\r\n拆包处理 */
        char rx_str[257];
        uint16_t copy_len = (lora_rx_len < sizeof(rx_str) - 1) ? lora_rx_len : (sizeof(rx_str) - 1);
        memcpy(rx_str, lora_rx_data, copy_len);
        rx_str[copy_len] = '\0';

#if LORA_DEBUG_VERBOSE
        char lora_raw_dbg[360];
        snprintf(lora_raw_dbg, sizeof(lora_raw_dbg),
                 "[LORA RX RAW] len=%u, data=%s\r\n",
                 (unsigned int)copy_len, rx_str);
        DEBUG_SendString(lora_raw_dbg);
#endif

        char *saveptr = NULL;
        uint8_t getdata_handled = 0;
        char last_line[256] = {0};
        char *line = strtok_r(rx_str, "\r\n", &saveptr);
        while(line != NULL)
        {
          if(line[0] != '\0')
          {
#if LORA_DEBUG_VERBOSE
            char lora_line_dbg[320];
            snprintf(lora_line_dbg, sizeof(lora_line_dbg),
                     "[LORA RX LINE] %s\r\n", line);
            DEBUG_SendString(lora_line_dbg);
#endif
            g_last_downlink_time = HAL_GetTick();

            /* 跳过同一批次重复行 */
            if(strcmp(line, last_line) == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }
            strncpy(last_line, line, sizeof(last_line) - 1);
            last_line[sizeof(last_line) - 1] = '\0';

            /* 过滤常见无关回显 */
            if(strcmp(line, "getData") == 0 || strcmp(line, "OK") == 0 || strcmp(line, "Power on") == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 长度不足设备ID的直接忽略 */
            if(strlen(line) < strlen(g_device_code))
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 使用ASCII字符串格式解析函数 */
            char payload[256];
            int payload_len = LORA_ParseStringPacket(
                                (uint8_t *)line, strlen(line),
                                g_device_code, payload, sizeof(payload));

            if(payload_len > 0)
            {
#if LORA_DEBUG_VERBOSE
              char lora_payload_dbg[320];
              snprintf(lora_payload_dbg, sizeof(lora_payload_dbg),
                       "[LORA RX PAYLOAD] %s\r\n", payload);
              DEBUG_SendString(lora_payload_dbg);
#endif

              /* 为命令比较生成大写副本，兼容RELAYOn/RELAYOff等混合大小写 */
              char payload_upper[256];
              strncpy(payload_upper, payload, sizeof(payload_upper) - 1);
              payload_upper[sizeof(payload_upper) - 1] = '\0';
              StrToUpper(payload_upper);

              /* 处理setting命令: settingMACCHANNEL */
              if(strncmp(payload_upper, "SETTING", 7) == 0)
              {
#if LORA_DEBUG_VERBOSE
                DEBUG_SendString("[LORA] Processing configuration command\r\n");
#endif

                /* 收到有效下行配置，重置重试间隔 */
                g_config_retry_interval_ms = 5000;
                g_config_retry_jitter_ms = 0;

                /* 提取setting后面的参数 */
                char *params = &payload[7];  /* 跳过"setting" */
                uint16_t params_len = strlen(params);

#if LORA_DEBUG_VERBOSE
                char debug_buf[128];
                snprintf(debug_buf, sizeof(debug_buf),
                         "[LORA] Params length: %d, Params: %.16s\r\n",
                         params_len, params);
                DEBUG_SendString(debug_buf);
#endif

                /* 解析MAC和CHANNEL (格式: MAC4字符+CHANNEL2字符) */
                if(params_len >= 6)  /* 至少需要4字符MAC+2字符CHANNEL */
                {
                  /* 前面4个字符是MAC,后面2个字符是CHANNEL */
                  char mac[5];
                  char channel[3];

                  /* 提取MAC (4个字符) */
                  memcpy(mac, params, 4);
                  mac[4] = '\0';

                  /* 提取CHANNEL (2个字符) */
                  memcpy(channel, &params[4], 2);
                  channel[2] = '\0';

                  /* 调用LoRa MAC和CHANNEL配置函数 */
                  if(LORA_ConfigureMacAndChannel(mac, channel) == 0)
                  {
#if LORA_DEBUG_VERBOSE
                    DEBUG_SendString("[LORA] MAC and CHANNEL configured successfully\r\n");
#endif

                    /* 等待LoRa模块重启完成并稳定（AT+RESET后需要时间初始化） */
                    HAL_Delay(500);

                    /* 保存MAC和CHANNEL，标记已配置 */
                    memcpy(g_lora_mac, mac, sizeof(g_lora_mac));
                    memcpy(g_lora_channel, channel, sizeof(g_lora_channel));
                    g_lora_configured = 1;
                    g_getdata_miss_count = 0;
                    g_waiting_getdata_ack = 0;
                    g_config_retry_interval_ms = 5000;
                    g_config_retry_jitter_ms = 0;

                    if(!g_system_initialized)
                    {
                      RELAY_On();  /* 继电器吸合，NO导通，负载通电（默认有人状态） */
                      g_system_initialized = 1;
                    }

                    /* 停止红色LED呼吸灯，表示配置成功 */
                    RED_LED_Breathing_Stop();

