luckyCharm1123/STM32_LED/Core/Src/main.c
                    /* 点亮绿色LED，表示系统配置成功 */
                    GREEN_LED_On();

                    /* 配置成功后发送确认消息: ok+MAC+CHANNEL+设备码 */
                    char confirm_msg[32];
                    snprintf(confirm_msg, sizeof(confirm_msg), "ok%s%s%s", mac, channel, g_device_code);

                    if(LORA_SendFormattedData(confirm_msg) != 0)
                    {
#if LORA_DEBUG_VERBOSE
                      DEBUG_SendString("[LORA] ERROR: Failed to send configuration confirmation\r\n");
#endif
                    }
                  }
                  else
                  {
#if LORA_DEBUG_VERBOSE
                    DEBUG_SendString("[LORA] ERROR: Failed to configure MAC and CHANNEL\r\n");
#endif
                  }
                }
                else
                {
#if LORA_DEBUG_VERBOSE
                  DEBUG_SendString("[LORA] ERROR: Invalid params format (need MAC+CHANNEL)\r\n");
#endif
                }
              }

              /* 统一命令匹配：兼容附加字段、前缀动作名、混合格式 */
              char *cmd = payload_upper;
              while(*cmd == ' ' || *cmd == '\t')
              {
                cmd++;
              }

              uint8_t is_relay_on_cmd = 0;
              uint8_t is_relay_off_cmd = 0;

              if(strcmp(cmd, "ON") == 0 ||
                 strcmp(cmd, "RELAYON") == 0)
              {
                is_relay_on_cmd = 1;
              }

              if(strcmp(cmd, "OFF") == 0 ||
                 strcmp(cmd, "RELAYOFF") == 0)
              {
                is_relay_off_cmd = 1;
              }

#if LORA_DEBUG_VERBOSE
              char lora_cmd_dbg[200];
              snprintf(lora_cmd_dbg, sizeof(lora_cmd_dbg),
                       "[LORA CMD] cmd=%s, on=%u, off=%u\r\n",
                       cmd, (unsigned int)is_relay_on_cmd, (unsigned int)is_relay_off_cmd);
              DEBUG_SendString(lora_cmd_dbg);
#endif

              /* 处理继电器命令 */
              if(is_relay_on_cmd)
              {
                if(g_lora_configured)
                {
                  RELAY_On();
                  StateSender_ReportRelayActionOnce();
#if LORA_DEBUG_VERBOSE
                  char relay_dbg[96];
                  snprintf(relay_dbg, sizeof(relay_dbg),
                           "[RELAY] ON exec, state=%u\r\n", (unsigned int)RELAY_GetState());
                  DEBUG_SendString(relay_dbg);
#endif
                }
              }
              else if(strcmp(cmd, "GETDATA") == 0 || strncmp(cmd, "GETDATA", 7) == 0)
              {
                /* 同一批次只处理一次getData */
                if(!getdata_handled)
                {
                  g_getdata_miss_count = 0;
                  g_waiting_getdata_ack = 0;
#if LORA_DEBUG_VERBOSE
                  DEBUG_SendString("[LORA CMD] GETDATA ack received\r\n");
#endif

                  /* 绿色LED闪烁一下（熄灭->延时->点亮） */
                  if(GREEN_LED_GetState())
                  {
                    GREEN_LED_Off();
                    HAL_Delay(50);  /* 熄灭50ms */
                    GREEN_LED_On(); /* 恢复点亮 */
                  }

                  getdata_handled = 1;
                }
              }
              else if(is_relay_off_cmd)
              {
                if(g_lora_configured)
                {
                  RELAY_Off();
                  StateSender_ReportRelayActionOnce();
#if LORA_DEBUG_VERBOSE
                  char relay_dbg[96];
                  snprintf(relay_dbg, sizeof(relay_dbg),
                           "[RELAY] OFF exec, state=%u\r\n", (unsigned int)RELAY_GetState());
                  DEBUG_SendString(relay_dbg);
#endif
                }
              }
              else
              {
#if LORA_DEBUG_VERBOSE
                char unknown_cmd_msg[160];
                snprintf(unknown_cmd_msg, sizeof(unknown_cmd_msg),
                         "[LORA] Unknown payload: %s\r\n", payload);
                DEBUG_SendString(unknown_cmd_msg);
#endif
              }
            }
            else
            {
#if LORA_DEBUG_VERBOSE
              char parse_fail_dbg[320];
              snprintf(parse_fail_dbg, sizeof(parse_fail_dbg),
                       "[LORA RX IGNORE] line=%s\r\n", line);
              DEBUG_SendString(parse_fail_dbg);
#endif
            }
          }

          line = strtok_r(NULL, "\r\n", &saveptr);
        }
      }
    }
    /* 每500ms处理并输出一次传感器状态 */
    if(g_lora_configured && (HAL_GetTick() - last_sensor_output_time >= sensor_output_interval))
    {
      Process_Sensor_Status(&last_radar_has_person);
      last_sensor_output_time = HAL_GetTick();
    }

    /* 状态发送机调度 - 只有在服务器配置成功后才发送数据 */
    if(g_lora_configured)
    {
      StateSender_Update();
    }

    /* 上报后若在窗口期内未收到getData，则记为一次超时 */
    if(g_lora_configured && g_waiting_getdata_ack)
    {
      const uint32_t getdata_timeout_ms = 7000;
      if((HAL_GetTick() - g_last_uplink_time) >= getdata_timeout_ms)
      {
        g_getdata_miss_count++;
        g_waiting_getdata_ack = 0;
      }
    }

    /* 连续3次未收到getData，退出发送模式并重初始化LoRa */
    if(g_lora_configured && g_getdata_miss_count >= 3)
    {
#if LORA_DEBUG_VERBOSE
      DEBUG_SendString("[LORA] getData timeout x3, exit send mode and reinit\r\n");
#endif

      /* 关键：回到默认监听参数(ff,ff/00)，以便接收服务器的重新分配下行 */
      if(LORA_Init(9600) != 0)
      {
        /* 初始化失败时也继续进入未配置态，由后续重试拉起 */
      }
      LORA_RearmRxIT();

      /* 退出发送模式并请求重新配置 */
      g_lora_configured = 0;
      g_getdata_miss_count = 0;
      g_waiting_getdata_ack = 0;
      g_config_retry_interval_ms = 5000;
      g_config_retry_jitter_ms = 0;

      /* 指示状态：绿灯灭，红灯呼吸 */
      GREEN_LED_Off();
      RED_LED_Breathing_Init();

      /* 等待LoRa模块重启完成并稳定（LORA_Init最后会AT+RESET） */
      HAL_Delay(500);

      /* 重初始化后请求服务器重新下发配置 */
      (void)Send_Config_Request();
    }

    /* 短暂延时，避免CPU空转 */
    HAL_Delay(10);
  }
}

/**
  * @brief System Clock Configuration 系统时钟配置
  * @details 配置STM32的系统时钟源和各总线时钟分频
  *          本配置使用内部高速时钟(HSI)作为系统时钟源
  *          HSI = 8MHz (内部RC振荡器)
  * @retval None 无返回值
  * @note 时钟树配置：
  *       HSI(8MHz) → SYSCLK(8MHz) → HCLK(8MHz)
  *       → PCLK1(8MHz) → APB1外设（包括USART2）
  *       → PCLK2(8MHz) → APB2外设
  * @note 时钟配置说明：
  *       - 不使用PLL，直接使用HSI作为系统时钟
  *       - 所有总线时钟都为8MHz
  *       - Flash等待周期为0（8MHz以下不需要等待）
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};  // 振荡器初始化结构体
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};  // 时钟初始化结构体

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  * 根据RCC_OscInitTypeDef结构体中的指定参数初始化RCC振荡器
  *
  * 配置振荡器参数：
  * - 选择振荡器类型：内部高速时钟(HSI)
  * - 设置工作状态：开启
  * - 校准值：使用默认校准值
  * - PLL状态：不使用（关闭）
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;  // 振荡器类型：内部高速时钟(HSI)
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;                    // HSI状态：开启
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;  // HSI校准值：默认值
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;              // PLL状态：不使用（PLL关闭）

  /* 应用振荡器配置 */
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();  // 如果配置失败，调用错误处理函数
  }

  /** Initializes the CPU, AHB and APB buses clocks
  * 初始化CPU、AHB和APB总线时钟
  *
  * 配置时钟树参数：
  * - 选择系统时钟源：HSI
  * - 设置各总线分频系数：都不分频
  * - 配置Flash等待周期：0（8MHz以下不需要等待）
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;  // 时钟类型：HCLK、SYSCLK、PCLK1、PCLK2
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;    // 系统时钟源：HSI
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;        // AHB时钟分频：不分频（HCLK = SYSCLK）
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;         // APB1时钟分频：不分频（PCLK1 = HCLK）
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;         // APB2时钟分频：不分频（PCLK2 = HCLK）

