luckyCharm1123/STM32_LED/Core/Src/main.c
  // 格式化为字符串：XXXXXXXX-XXXXXXXX-XXXXXXXX
  sprintf(uid_str, "%08" PRIX32 "%08" PRIX32 "%08" PRIX32, uid_0, uid_1, uid_2);
}

/**
  * @brief 处理传感器状态并输出
  * @param last_combined_state: 上次雷达状态的指针（用于检测状态切换）
  * @retval 当前雷达状态（0=无人，1=有人）
  * @details 处理毫米波雷达状态，状态变化时触发快速发送模式
  */
uint8_t Process_Sensor_Status(uint8_t *last_combined_state)
{
  if(!g_lora_configured)
  {
    return *last_combined_state;
  }

  /* 获取雷达目标状态 */
  Radar_TargetStatus_t target_status = RADAR_GetTargetStatus();

  /* 判断雷达状态：DETECTED、WITH_INFO、BUFFERING 都算有人 */
  uint8_t radar_has_person = 0;
  if(target_status == RADAR_TARGET_DETECTED ||
     target_status == RADAR_TARGET_WITH_INFO ||
     target_status == RADAR_TARGET_BUFFERING)
  {
    radar_has_person = 1;
  }

  /* 检测雷达状态变化（无论是有人->无人 还是 无人->有人） */
  if(radar_has_person != *last_combined_state)
  {
    /* 状态发生变化：触发快速发送模式（10次，5s） */
    StateSender_ResetFastMode();

    if(radar_has_person == 1)
    {
      /* 检测到人：吸合继电器（NO导通，负载通电） */
      RELAY_On();
      // DEBUG_SendString("[SENSOR] State changed: NOBODY -> PERSON, Relay ON (NO connected)\r\n");
    }
    else
    {
      /* 无人：断开继电器（NO断开，负载断电）- 已禁用 */
      // RELAY_Off();
      // DEBUG_SendString("[SENSOR] State changed: PERSON -> NOBODY, Relay OFF (NO disconnected)\r\n");
    }

    /* 立即发送一次快速状态 */
    if(g_state_sender.initialized)
    {
      // DEBUG_SendString("[SENSOR] Sending fast status...\r\n");
      int send_ret = StateSender_SendFast();
      g_state_sender.last_send_time = HAL_GetTick();
      if(send_ret == 0 && g_state_sender.fast_remaining > 0)
      {
        g_state_sender.fast_remaining--;
        if(g_state_sender.fast_remaining == 0)
        {
          g_state_sender.interval_ms = STATE_SENDER_NORMAL_INTERVAL_MS;  /* 正常发送间隔 */
          // DEBUG_SendString("[STATE] Switch to normal mode (15s)\r\n");
        }
      }
    }
    else
    {
      // DEBUG_SendString("[SENSOR] State sender not initialized, skip sending\r\n");
    }
  }

  /* 更新上次的雷达状态 */
  *last_combined_state = radar_has_person;

  return radar_has_person;
}

/**
  * @brief 初始化状态发送机
  * @retval None
  * @details 初始化发送状态和时间戳，通电后直接进入快速模式（10次，5s间隔）
  *          10次快速发送后自动切换到正常模式（15s间隔）
  */
void StateSender_Init(void)
{
  g_state_sender.send_state = 0;
  g_state_sender.last_send_time = HAL_GetTick();
  g_state_sender.interval_ms = STATE_SENDER_FAST_INTERVAL_MS;  /* 快速发送间隔 */
  g_state_sender.fast_remaining = 10;    /* 通电后直接进入快速模式（10次） */
  g_state_sender.initialized = 1;
}

/**
  * @brief 进入/重置快速发送模式
  * @retval None
  */
void StateSender_ResetFastMode(void)
{
  g_state_sender.interval_ms = STATE_SENDER_FAST_INTERVAL_MS;  /* 快速发送间隔 */
  g_state_sender.fast_remaining = 10;
  g_state_sender.last_send_time = HAL_GetTick();
  // DEBUG_SendString("[STATE] Fast mode reset (10 times)\r\n");
}

/**
  * @brief 状态发送机更新
  * @retval None
  * @details 快速模式（10次，5s间隔）后切换到正常模式（15s间隔）
  */
void StateSender_Update(void)
{
  if(!g_state_sender.initialized)
  {
    /* 未初始化，不发送 */
    return;
  }

  uint32_t now = HAL_GetTick();

  /* 快速模式下，收到下行后优先留出接收窗口，降低下行丢失概率 */
  if(g_state_sender.fast_remaining > 0 && g_state_sender.fast_remaining != 0xFF)
  {
    if((now - g_last_downlink_time) < LORA_DOWNLINK_GUARD_MS)
    {
      return;
    }
  }
  if(now - g_state_sender.last_send_time < g_state_sender.interval_ms)
  {
    return;
  }

  /* 触发一次发送 */
  if(g_state_sender.fast_remaining > 0 && g_state_sender.fast_remaining != 0xFF)
  {
    /* 快速模式：发送快速状态 */
    // DEBUG_SendString("[STATE] Triggering fast scheduled send...\r\n");
    (void)StateSender_SendFast();
  }
  else
  {
    /* 正常模式：发送完整状态 */
    // DEBUG_SendString("[STATE] Triggering normal scheduled send...\r\n");
    (void)StateSender_SendNormal();
  }
  g_state_sender.send_state++;
  g_state_sender.last_send_time = now;

  /* 处理快速模式次数递减（0xFF表示永久快速模式，不递减） */
  if(g_state_sender.fast_remaining > 0 && g_state_sender.fast_remaining != 0xFF)
  {
    g_state_sender.fast_remaining--;
    char mode_msg[128];
    snprintf(mode_msg, sizeof(mode_msg), "[STATE] Fast remaining: %d\r\n", g_state_sender.fast_remaining);
    // DEBUG_SendString(mode_msg);

    if(g_state_sender.fast_remaining == 0)
    {
      g_state_sender.interval_ms = STATE_SENDER_NORMAL_INTERVAL_MS;  /* 正常发送间隔 */
      // DEBUG_SendString("[STATE] Switch to normal mode (15s)\r\n");
    }
  }
}

/**
  * @brief 快速发送函数
  * @retval 0: 成功, -1: 失败
  * @details 发送格式: dev_设备码P_平均P值R_平均R值S_状态
  */
int StateSender_SendFast(void)
{
  /* 获取雷达数据 */
  Radar_TargetStatus_t status = StateSender_GetRadarStatus();
  uint8_t s_val = (status == RADAR_TARGET_NOBODY) ? 0 : 1;
  uint16_t valid_count = StateSender_GetRadarValidCount();
  uint32_t p_sum = StateSender_GetRadarPowerSum();
  uint32_t r_sum = StateSender_GetRadarRangeSum();
  uint32_t p_avg = 0;
  uint32_t r_avg = 0;
  if(s_val == 1 && valid_count > 0)
  {
    p_avg = p_sum / valid_count;
    r_avg = r_sum / valid_count;
  }

  /* 获取继电器状态 */
  uint8_t relay_state = RELAY_GetState();

  char payload[64];
  snprintf(payload, sizeof(payload), "dev_%sP_%luR_%luS_%uRELAY_%u",
           g_device_code,
           (unsigned long)p_avg,
           (unsigned long)r_avg,
           s_val,
           relay_state);

  if(LORA_SendFormattedData(payload) == 0)
  {
    /* 发送完成后重置毫米波雷达累积值 */
    RADAR_ClearAccumulatedData();
    LORA_MarkUplinkAndTrackGetdata();
    // DEBUG_SendString("[STATE] Fast status sent\r\n");
    return 0;
  }

  // DEBUG_SendString("[STATE] Fast status send failed\r\n");
  return -1;
}

/**
  * @brief 正常发送函数 (雷达状态固定为无人，后续接入真实雷达数据)
  * @retval 0: 成功, -1: 失败
  * @details 发送格式: dev_设备码humi_湿度值temp_温度值sound_声音值light_光照值P_平均P值R_平均R值S_状态
  */
int StateSender_SendNormal(void)
{
  /* 获取温湿度 */
  float temp = 0.0f;
  float humi = 0.0f;
  (void)StateSender_GetTempHumi(&temp, &humi);

  /* 读取两次上报间隔内的声音平均值（ADC原始值） */
  uint16_t sound_raw = SoundAccumulator_GetAverageAndReset();

  /* 计算电压值（毫伏，避免浮点数格式化问题） */
  uint16_t sound_mv = (uint16_t)(sound_raw * 3300UL / 4095UL);

  /* 输出声音传感器详细诊断信息 */
  char sound_debug[128];
  snprintf(sound_debug, sizeof(sound_debug), "[SOUND] AVG ADC:%u, Volt:%u.%03uV\r\n",
           sound_raw, sound_mv / 1000, sound_mv % 1000);
  // DEBUG_SendString(sound_debug);

  /* 读取光照强度 */
  float lux = 0.0f;
  int32_t lux10 = 0;  // 光照值*10（保留1位小数）
  uint16_t als_raw = 0;
  uint16_t als_conf = 0;
  uint16_t als_id = 0;
  static uint8_t light_zero_streak = 0;
  int8_t als_raw_ok = VEML7700_Soft_ReadRaw(&als_raw);
  int8_t als_conf_ok = VEML7700_ReadReg(VEML7700_REG_ALS_CONF, &als_conf);
  int8_t als_id_ok = VEML7700_ReadReg(VEML7700_REG_INT_ID, &als_id);

  if(VEML7700_Soft_ReadLux(&lux) == 0)
  {
    lux10 = (int32_t)(lux * 10.0f + (lux >= 0 ? 0.5f : -0.5f));
    char light_debug[64];
    snprintf(light_debug, sizeof(light_debug), "[LIGHT] %ld.%01lu lux\r\n",
             (long)(lux10 / 10), (unsigned long)(lux10 >= 0 ? (lux10 % 10) : (-(lux10 % 10))));
    // DEBUG_SendString(light_debug);

