luckyCharm1123/STM32_LED/Core/Src/main.c
    /* 诊断输出：原始计数与配置寄存器 */
    char light_diag[128];
    snprintf(light_diag, sizeof(light_diag),
         "[LIGHT DBG] raw:%u conf:0x%04X id:0x%04X raw_ok:%d conf_ok:%d id_ok:%d\r\n",
         (unsigned int)als_raw, (unsigned int)als_conf, (unsigned int)als_id,
         als_raw_ok, als_conf_ok, als_id_ok);
    // DEBUG_SendString(light_diag);

    /* 连续原始值为0时自动重初始化一次，尝试恢复 */
    if(als_raw_ok == 0 && als_raw == 0)
    {
      if(light_zero_streak < 255)
      {
        light_zero_streak++;
      }
    }
    else
    {
      light_zero_streak = 0;
    }

    if(light_zero_streak >= 3)
    {
      // DEBUG_SendString("[LIGHT] raw=0 streak, reinit sensor...\r\n");
      if(VEML7700_Soft_Init() == 0)
      {
        // DEBUG_SendString("[LIGHT] reinit OK\r\n");
      }
      else
      {
        // DEBUG_SendString("[LIGHT] reinit FAILED\r\n");
      }
      light_zero_streak = 0;
    }
  }
  else
  {
    // DEBUG_SendString("[LIGHT] ERROR: read failed\r\n");
  }

  /* 获取雷达数据 */
  Radar_TargetStatus_t status = StateSender_GetRadarStatus();
  uint8_t s_val = (status == RADAR_TARGET_NOBODY) ? 0 : 1;
  uint16_t valid_count = StateSender_GetRadarValidCount();
  uint32_t p_sum = StateSender_GetRadarPowerSum();
  uint32_t r_sum = StateSender_GetRadarRangeSum();
  uint32_t p_avg = 0;
  uint32_t r_avg = 0;
  if(s_val == 1 && valid_count > 0)
  {
    p_avg = p_sum / valid_count;
    r_avg = r_sum / valid_count;
  }

  /* 温湿度保留2位小数，*100发送为整数（如 22.34 -> 2234） */
  int32_t humi100 = (int32_t)(humi * 100.0f + (humi >= 0 ? 0.5f : -0.5f));
  int32_t temp100 = (int32_t)(temp * 100.0f + (temp >= 0 ? 0.5f : -0.5f));

  /* 获取继电器状态 */
  uint8_t relay_state = RELAY_GetState();

  /* 读取CO2浓度（非阻塞状态机方式）*/
  uint16_t co2_ppm = 0;
  uint8_t co2_valid = 0;

  if(MHZ19B_Co2SM_IsDone(&g_co2_sm))
  {
    /* 上次测量已完成：取结果，启动新一轮 */
    co2_ppm = g_co2_sm.result_ppm;
    co2_valid = g_co2_sm.valid;
    MHZ19B_Co2SM_Start(&g_co2_sm);
  }
  else
  {
    /* 测量仍在进行中：使用缓存结果 */
    co2_ppm = g_co2_sm.result_ppm;
    co2_valid = g_co2_sm.valid;
  }

#if LORA_DEBUG_VERBOSE
  if((co2_valid == 0) || (co2_ppm > 0 && co2_ppm < 200))
  {
    char co2_diag_msg[128];
    snprintf(co2_diag_msg, sizeof(co2_diag_msg),
             "[CO2 DBG] valid:%u ppm:%u high:%ums low:%ums period:%ums state:%u\r\n",
             co2_valid, co2_ppm, g_co2_sm.high_time_ms, g_co2_sm.low_time_ms,
             (uint16_t)(g_co2_sm.high_time_ms + g_co2_sm.low_time_ms), g_co2_sm.state);
    DEBUG_SendString(co2_diag_msg);
  }
#endif

  char payload[128];
  snprintf(payload, sizeof(payload), "dev_%shumi_%ldtemp_%ldsound_%ulight_%ldP_%luR_%luS_%uRELAY_%uCO2_%u",
           g_device_code,
           (long)humi100, (long)temp100,
           sound_raw, (long)lux10,
           (unsigned long)p_avg, (unsigned long)r_avg, s_val,
           relay_state, co2_valid ? co2_ppm : 0);

  if(LORA_SendFormattedData(payload) == 0)
  {
    /* 发送完成后重置毫米波雷达累积值 */
    RADAR_ClearAccumulatedData();
    LORA_MarkUplinkAndTrackGetdata();
    // DEBUG_SendString("[STATE] Normal status sent\r\n");
    return 0;
  }

  // DEBUG_SendString("[STATE] Normal status send failed\r\n");
  return -1;
}

/**
  * @brief 获取毫米波雷达状态
  * @retval Radar_TargetStatus_t 雷达状态
  */
Radar_TargetStatus_t StateSender_GetRadarStatus(void)
{
  return RADAR_GetTargetStatus();
}

/**
  * @brief 获取P值总值
  * @retval P值累积总和
  */
uint32_t StateSender_GetRadarPowerSum(void)
{
  return Radar.target_info.power_sum;
}

/**
  * @brief 获取R值总值
  * @retval R值累积总和
  */
uint32_t StateSender_GetRadarRangeSum(void)
{
  return Radar.target_info.range_sum;
}

/**
  * @brief 获取有效次数
  * @retval 有效数据次数
  */
uint16_t StateSender_GetRadarValidCount(void)
{
  return Radar.target_info.valid_count;
}

/**
  * @brief 获取温湿度
  * @param temp: 温度输出指针
  * @param humi: 湿度输出指针
  * @retval 0: 成功, -1: 失败
  */
int StateSender_GetTempHumi(float *temp, float *humi)
{
  if(temp == NULL || humi == NULL)
  {
    return -1;
  }

  return (SHT30_Soft_Read(temp, humi) == 0) ? 0 : -1;
}

/**
  * @brief 获取声音等级
  * @retval 声音等级(0-100)，255表示失败
  * @details 读取声音传感器的声音强度等级
  */
uint16_t StateSender_GetSoundLevel(void)
{
  return SOUND_SENSOR_GetLevel();
}

/**
  * @brief 重新初始化LoRa并配置MAC/CHANNEL
  * @retval None
  */
void LORA_ReinitAndConfig(void)
{
  /* 进入AT模式需要前后静默窗口，这里在重初始化前保持2s静默 */
  // DEBUG_SendString("[LORA] Starting reinitialization...\r\n");

  /* 清空LoRa接收缓冲区 */
  extern LORA_Status_t lora_status;
  lora_status.rx_length = 0;
  lora_status.data_ready = 0;
  memset(lora_status.rx_buffer, 0, LORA_RX_BUFFER_SIZE);

  /* 清空UART的错误标志和接收缓冲区 */
  __HAL_UART_CLEAR_OREFLAG(&huart2);
  __HAL_UART_CLEAR_FEFLAG(&huart2);
  __HAL_UART_CLEAR_NEFLAG(&huart2);
  __HAL_UART_CLEAR_IDLEFLAG(&huart2);

  /* 保持2秒静默,确保没有任何数据传输 */
  // DEBUG_SendString("[LORA] Waiting 2s for silence...\r\n");
  HAL_Delay(2000);

  // DEBUG_SendString("[LORA] Calling LORA_Init...\r\n");
  if(LORA_Init(9600) != 0)
  {
    // DEBUG_SendString("[LORA] Reinit failed\r\n");
    return;
  }

  if(g_lora_mac[0] != '\0' && g_lora_channel[0] != '\0')
  {
    if(LORA_ConfigureMacAndChannel(g_lora_mac, g_lora_channel) == 0)
    {
      // DEBUG_SendString("[LORA] Re-configured MAC/CHANNEL successfully\r\n");
    }
    else
    {
      // DEBUG_SendString("[LORA] Re-config MAC/CHANNEL failed\r\n");
    }
  }
}

/**
  * @brief 生成8位设备码
  * @param device_code: 存储8位设备码的缓冲区（至少9字节，包含结束符）
  * @retval None
  * @details 基于STM32唯一ID生成8位十六进制设备码
  *          取UID的前32位，转换为8位十六进制字符串
  *          这样每台设备都有唯一的设备标识
  */
void Generate_Device_Code(char *device_code)
{
  // STM32F103唯一ID地址：0x1FFFF7E8
  const uint32_t *uid_base = (const uint32_t *)0x1FFFF7E8U;

  // 读取第一个32位ID
  uint32_t uid_0 = uid_base[0];

  // 格式化为8位十六进制字符串
  sprintf(device_code, "%08" PRIX32, uid_0);
}

/**
  * @brief UART接收事件回调函数
  * @param huart: UART句柄
  * @param Size: 当前DMA缓冲区中的数据量
  * @retval None
  * @details 当DMA接收完成或检测到空闲帧时调用此函数
  *          用于USART3的雷达数据接收
  */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
  // 检查是否是USART3的中断（雷达数据）
  if(huart->Instance == USART3)
  {
      // 调用雷达驱动的UART事件回调函数
      RADAR_UART_RxEventCallback(huart, Size);
  }
}

/**
  * @brief UART错误回调函数
  * @param huart: UART句柄
  * @retval None
  * @details 处理USART3接收过程中的ORE/FE/NE/PE错误，清标志并重启DMA接收
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  if(huart->Instance == USART3)
  {
    static uint32_t last_err_log_time = 0;
    static uint32_t err_count = 0;
    uint32_t err = huart->ErrorCode;

    /* 清除常见错误标志 */
    __HAL_UART_CLEAR_OREFLAG(huart);
    __HAL_UART_CLEAR_FEFLAG(huart);
    __HAL_UART_CLEAR_NEFLAG(huart);
    __HAL_UART_CLEAR_PEFLAG(huart);

    /* 终止当前接收并重启DMA空闲接收 */
    (void)HAL_UART_AbortReceive(huart);
    if(HAL_UARTEx_ReceiveToIdle_DMA(huart, Radar.rx_buffer, sizeof(Radar.rx_buffer)) == HAL_OK)
    {
      Radar.old_pos = 0;
      Radar.accum_len = 0;
      Radar.frame_ready = 0;
      Radar.state = RADAR_STATE_OK;
      uint32_t now = HAL_GetTick();
      if(now - last_err_log_time >= 1000)
      {
        char err_msg[128];
        err_count++;
        snprintf(err_msg, sizeof(err_msg), "[RADAR] UART error recovered, RX restarted (err=0x%08lX cnt=%lu)\r\n",
                 (unsigned long)err, (unsigned long)err_count);
        // DEBUG_SendString(err_msg);
        last_err_log_time = now;
      }
    }
    else
    {
      Radar.state = RADAR_STATE_ERROR;
      uint32_t now = HAL_GetTick();
      if(now - last_err_log_time >= 1000)
      {
        char err_msg[128];
        err_count++;
        snprintf(err_msg, sizeof(err_msg), "[RADAR] UART error recovery failed (err=0x%08lX cnt=%lu)\r\n",
                 (unsigned long)err, (unsigned long)err_count);
        // DEBUG_SendString(err_msg);
        last_err_log_time = now;
      }
    }
  }
  else if(huart->Instance == USART2)
  {
    extern LORA_Status_t lora_status;
    extern uint8_t lora_rx_byte;

    __HAL_UART_CLEAR_OREFLAG(huart);
    __HAL_UART_CLEAR_FEFLAG(huart);
    __HAL_UART_CLEAR_NEFLAG(huart);
    __HAL_UART_CLEAR_PEFLAG(huart);
    __HAL_UART_CLEAR_IDLEFLAG(huart);

